Tag-service/GetTagById.yml
config:
  target: "https://staging-app.cliquidator.info"
  tls: 
    rejectUnauthorized: false
  processor: '../login_processor.js'
  phases:
    - name: "load testing"
      duration: 2
      arrivalRate: 1

scenarios:
  - name: "Get a Single Tag by Id"
    flow:
      - function: "getToken"
      - get:
          url: "/v1/tags/1"
          headers:
            Authorization: "Bearer {{ token }}"
            Content-Type: "application/json"
          capture:
            - json: "$.description"
              as: "description"
            - json: "$.label"
              as: "label"
            - json: "$.id"
              as: "tagId"
              strict: false  
      - log: "tagId: {{ tagId }}"  
      - log: "description: {{ description }}"
      - log: "label: {{ label }}"